cmsis-svd/cmsis-svd/data/Freescale/MK50D7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>MCM</name>
      <description>Core Platform Miscellaneous Control Module</description>
      <prependToName>MCM_</prependToName>
      <baseAddress>0xE0080000</baseAddress>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PLASC</name>
          <description>Crossbar switch (AXBS) slave configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ASC</name>
              <description>Each bit in the ASC field indicates if there is a corresponding connection to the crossbar switch&apos;s slave input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A bus slave connection to AXBS input port n is absent</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A bus slave connection to AXBS input port n is present</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAMC</name>
          <description>Crossbar switch (AXBS) master configuration</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x3F</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>AMC</name>
              <description>Each bit in the AMC field indicates if there is a corresponding connection to the AXBS master input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>A bus master connection to AXBS input port n is absent</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>A bus master connection to AXBS input port n is present</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRAMUAP</name>
              <description>SRAM_U arbitration priority</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Round robin</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Special round robin (favors SRAM backoor accesses over the processor)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMUWP</name>
              <description>SRAM_U write protect</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMLAP</name>
              <description>SRAM_L arbitration priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>00</name>
                  <description>Round robin</description>
                  <value>#00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>01</name>
                  <description>Special round robin (favors SRAM backoor accesses over the processor)</description>
                  <value>#01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>Fixed priority. Processor has highest, backdoor has lowest</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11</name>
                  <description>Fixed priority. Backdoor has highest, processor has lowest</description>
                  <value>#11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMLWP</name>
              <description>SRAM_L write protect</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
